<!-- terraform-plan-comment -->
### 📦 Terraform Plan Result
```
data.aws_availability_zones.available: Reading...
module.master_node_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=master-node-role]
aws_vpc.k8s: Refreshing state... [id=vpc-086e52a33a864ff2e]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.master_node_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=master-node-role:master-node-role-policy]
module.master_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=master-node-role-profile]
aws_internet_gateway.k8s: Refreshing state... [id=igw-02524fe0cc2fa7c0a]
aws_subnet.public[2]: Refreshing state... [id=subnet-0e00b538d8010a536]
aws_subnet.public[0]: Refreshing state... [id=subnet-03db3655b617f6817]
aws_subnet.public[1]: Refreshing state... [id=subnet-091c91645e010625b]
aws_security_group.k8s: Refreshing state... [id=sg-01bf9bc28bfba67cd]
aws_route_table.k8s: Refreshing state... [id=rtb-0bd02e70a9a3f5884]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-09cd4354b96a4dbdd]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d3b36ef6c734995b]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07b4e6a9230757cb9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bootstrap_bucket.aws_s3_bucket.worker_node_token will be created
  + resource "aws_s3_bucket" "worker_node_token" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "k8s-bootstrap-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "k8s-bootstrap-artifacts"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "k8s-bootstrap-artifacts"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.bootstrap_bucket.aws_s3_bucket_public_access_block.worker_node_token_access will be created
  + resource "aws_s3_bucket_public_access_block" "worker_node_token_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.master.aws_instance.cluster_ec2[0] will be created
  + resource "aws_instance" "cluster_ec2" {
      + ami                                  = "ami-020cba7c55df1f615"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "master-node-role-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "test_key_demo"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-03db3655b617f6817"
      + tags                                 = {
          + "Name" = "k8s-master"
        }
      + tags_all                             = {
          + "Name" = "k8s-master"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "e4c951e3f568072c14e444a7c52c667a4f0c03f8"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-01bf9bc28bfba67cd",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```